In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
data = {
    'Country': ['China', 'India', 'Brazil'],
    'Capital': ['Beijing', 'New Delhi', 'Brasilia'],
    'Population': ['1432732201', '1303171635', '207847528']
}
df = DataFrame(data)

In [3]:
s1 = Series(data['Country'],index=["A","B","C"]) #没有index参数，默认从 0  1  2 开始

In [4]:
s1

A     China
B     India
C    Brazil
dtype: object

In [5]:
s1.values

array(['China', 'India', 'Brazil'], dtype=object)

In [6]:
s1.index

Index(['A', 'B', 'C'], dtype='object')

# 通过Series创建DataFrame

In [7]:
s1 = Series(data['Country'])
s2 = Series(data['Capital'])
s3 = Series(data['Population'])

df1 = pd.DataFrame(data)    # DataFrame 每一行都由series组成
df1
for row in df1.iterrows():
    print(row[0], row[1])
    break

0 Country            China
Capital          Beijing
Population    1432732201
Name: 0, dtype: object

In [8]:
cou = df1["Country"]
type(cou)

pandas.core.series.Series

In [9]:
df1.iterrows() # 生成器

In [10]:
for row in df1.iterrows(): # 每次取出一行
    print(row),print(type(row)),print(len(row),"****");
    # print(row[0],row[1],type(row[0]),type(row[1]),"---");

(0, Country            China
Capital          Beijing
Population    1432732201
Name: 0, dtype: object)
<class 'tuple'>
2 ****
(1, Country            India
Capital        New Delhi
Population    1303171635
Name: 1, dtype: object)
<class 'tuple'>
2 ****
(2, Country          Brazil
Capital        Brasilia
Population    207847528
Name: 2, dtype: object)
<class 'tuple'>
2 ****

In [11]:
df_new = DataFrame([s1,s2,s3]) # 传入Series list

In [12]:
df_new      # 行列变化了

            0           1          2
0       China       India     Brazil
1     Beijing   New Delhi   Brasilia
2  1432732201  1303171635  207847528

In [13]:
df

  Country    Capital  Population
0   China    Beijing  1432732201
1   India  New Delhi  1303171635
2  Brazil   Brasilia   207847528

In [14]:
df_new = DataFrame([s1,s2,s3], index=['Country','Capital', 'Population']) # index 默认数字

In [15]:
df_new

                     0           1          2
Country          China       India     Brazil
Capital        Beijing   New Delhi   Brasilia
Population  1432732201  1303171635  207847528

In [16]:
df_new.T

  Country    Capital  Population
0   China    Beijing  1432732201
1   India  New Delhi  1303171635
2  Brazil   Brasilia   207847528

In [17]:
df

  Country    Capital  Population
0   China    Beijing  1432732201
1   India  New Delhi  1303171635
2  Brazil   Brasilia   207847528